socialNetwork/wrk2/digital-ocean1/COMMAND_2/4
Running 1m test @ http://143.110.248.178:31111/wrk2-api/home-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 15.783ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 14.960ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 15.202ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 14.579ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 15.943ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 15.276ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 15.260ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 15.431ms, rate sampling interval: 51ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.17ms   16.20ms  89.54ms   92.08%
    Req/Sec    12.01     17.36    41.00     71.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.18ms
 75.000%   20.38ms
 90.000%   30.33ms
 99.000%   89.54ms
 99.900%  137.09ms
 99.990%  175.10ms
 99.999%  175.10ms
100.000%  175.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.271     0.000000            1         1.00
       7.591     0.100000          480         1.11
       8.831     0.200000          960         1.25
      10.047     0.300000         1443         1.43
      11.599     0.400000         1921         1.67
      13.175     0.500000         2400         2.00
      14.327     0.550000         2642         2.22
      15.503     0.600000         2880         2.50
      16.719     0.650000         3124         2.86
      18.511     0.700000         3360         3.33
      20.383     0.750000         3602         4.00
      21.455     0.775000         3721         4.44
      22.575     0.800000         3840         5.00
      24.191     0.825000         3960         5.71
      25.679     0.850000         4083         6.67
      27.551     0.875000         4201         8.00
      28.799     0.887500         4260         8.89
      30.335     0.900000         4320        10.00
      32.479     0.912500         4380        11.43
      35.647     0.925000         4440        13.33
      40.895     0.937500         4500        16.00
      45.247     0.943750         4532        17.78
      47.871     0.950000         4560        20.00
      53.119     0.956250         4590        22.86
      60.831     0.962500         4620        26.67
      65.791     0.968750         4650        32.00
      69.311     0.971875         4665        35.56
      72.063     0.975000         4681        40.00
      76.223     0.978125         4695        45.71
      81.471     0.981250         4710        53.33
      83.007     0.984375         4725        64.00
      85.055     0.985938         4733        71.11
      87.551     0.987500         4740        80.00
      88.639     0.989062         4748        91.43
      89.919     0.990625         4755       106.67
      91.839     0.992188         4763       128.00
      93.887     0.992969         4767       142.22
      94.719     0.993750         4770       160.00
      97.023     0.994531         4774       182.86
     104.831     0.995313         4778       213.33
     110.591     0.996094         4782       256.00
     111.871     0.996484         4784       284.44
     113.727     0.996875         4785       320.00
     115.903     0.997266         4787       365.71
     118.399     0.997656         4789       426.67
     128.767     0.998047         4791       512.00
     131.711     0.998242         4792       568.89
     132.735     0.998437         4793       640.00
     133.631     0.998633         4794       731.43
     137.087     0.998828         4795       853.33
     140.927     0.999023         4796      1024.00
     140.927     0.999121         4796      1137.78
     159.743     0.999219         4797      1280.00
     159.743     0.999316         4797      1462.86
     164.735     0.999414         4798      1706.67
     164.735     0.999512         4798      2048.00
     164.735     0.999561         4798      2275.56
     172.287     0.999609         4799      2560.00
     172.287     0.999658         4799      2925.71
     172.287     0.999707         4799      3413.33
     172.287     0.999756         4799      4096.00
     172.287     0.999780         4799      4551.11
     175.103     0.999805         4800      5120.00
     175.103     1.000000         4800          inf
#[Mean    =       18.170, StdDeviation   =       16.205]
#[Max     =      174.976, Total count    =         4800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5744 requests in 1.00m, 1.09MB read
Requests/sec:     95.72
Transfer/sec:     18.60KB